#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_id.db_name_suffix[0]: Refreshing state... [id=cJA_dA]
random_password.db_password[0]: Refreshing state... [id=none]
google_iam_workload_identity_pool.github: Refreshing state... [id=projects/tech-island-482603/locations/global/workloadIdentityPools/github-actions]
google_service_account.gke_nodes: Refreshing state... [id=projects/tech-island-482603/serviceAccounts/tech-island-gke-nodes@tech-island-482603.iam.gserviceaccount.com]
google_project_service.required_apis["container.googleapis.com"]: Refreshing state... [id=tech-island-482603/container.googleapis.com]
google_service_account.mcp_server: Refreshing state... [id=projects/tech-island-482603/serviceAccounts/mcp-server@tech-island-482603.iam.gserviceaccount.com]
google_project_service.required_apis["iamcredentials.googleapis.com"]: Refreshing state... [id=tech-island-482603/iamcredentials.googleapis.com]
google_project_service.required_apis["artifactregistry.googleapis.com"]: Refreshing state... [id=tech-island-482603/artifactregistry.googleapis.com]
google_service_account.github_actions: Refreshing state... [id=projects/tech-island-482603/serviceAccounts/tech-island-github-actions@tech-island-482603.iam.gserviceaccount.com]
google_project_service.required_apis["compute.googleapis.com"]: Refreshing state... [id=tech-island-482603/compute.googleapis.com]
google_project_service.required_apis["iam.googleapis.com"]: Refreshing state... [id=tech-island-482603/iam.googleapis.com]
google_project_service.required_apis["logging.googleapis.com"]: Refreshing state... [id=tech-island-482603/logging.googleapis.com]
google_project_service.required_apis["sqladmin.googleapis.com"]: Refreshing state... [id=tech-island-482603/sqladmin.googleapis.com]
google_project_service.required_apis["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=tech-island-482603/cloudresourcemanager.googleapis.com]
google_project_service.required_apis["servicenetworking.googleapis.com"]: Refreshing state... [id=tech-island-482603/servicenetworking.googleapis.com]
google_compute_global_address.ingress_ip[0]: Refreshing state... [id=projects/tech-island-482603/global/addresses/tech-island-ingress-ip]
google_compute_network.vpc: Refreshing state... [id=projects/tech-island-482603/global/networks/tech-island-vpc]
google_artifact_registry_repository.containers: Refreshing state... [id=projects/tech-island-482603/locations/europe-west2/repositories/tech-island-containers]
google_project_iam_member.github_actions_gke: Refreshing state... [id=tech-island-482603/roles/container.admin/serviceAccount:tech-island-github-actions@tech-island-482603.iam.gserviceaccount.com]
google_project_iam_member.gke_nodes_metric_writer: Refreshing state... [id=tech-island-482603/roles/monitoring.metricWriter/serviceAccount:tech-island-gke-nodes@tech-island-482603.iam.gserviceaccount.com]
google_project_iam_member.gke_nodes_log_writer: Refreshing state... [id=tech-island-482603/roles/logging.logWriter/serviceAccount:tech-island-gke-nodes@tech-island-482603.iam.gserviceaccount.com]
google_project_iam_member.gke_nodes_artifact_reader: Refreshing state... [id=tech-island-482603/roles/artifactregistry.reader/serviceAccount:tech-island-gke-nodes@tech-island-482603.iam.gserviceaccount.com]
google_project_iam_member.gke_nodes_monitoring_viewer: Refreshing state... [id=tech-island-482603/roles/monitoring.viewer/serviceAccount:tech-island-gke-nodes@tech-island-482603.iam.gserviceaccount.com]
google_project_iam_member.mcp_monitoring_viewer: Refreshing state... [id=tech-island-482603/roles/monitoring.viewer/serviceAccount:mcp-server@tech-island-482603.iam.gserviceaccount.com]
google_project_iam_member.mcp_container_developer: Refreshing state... [id=tech-island-482603/roles/container.developer/serviceAccount:mcp-server@tech-island-482603.iam.gserviceaccount.com]
google_project_iam_member.mcp_logging_viewer: Refreshing state... [id=tech-island-482603/roles/logging.viewer/serviceAccount:mcp-server@tech-island-482603.iam.gserviceaccount.com]
google_project_iam_member.mcp_gke_viewer: Refreshing state... [id=tech-island-482603/roles/container.viewer/serviceAccount:mcp-server@tech-island-482603.iam.gserviceaccount.com]
google_iam_workload_identity_pool_provider.github: Refreshing state... [id=projects/tech-island-482603/locations/global/workloadIdentityPools/github-actions/providers/github-provider]
google_service_account_iam_member.github_actions_workload_identity: Refreshing state... [id=projects/tech-island-482603/serviceAccounts/tech-island-github-actions@tech-island-482603.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/284859610754/locations/global/workloadIdentityPools/github-actions/attribute.repository/jerome3o/tech-island]
google_compute_subnetwork.subnet: Refreshing state... [id=projects/tech-island-482603/regions/europe-west2/subnetworks/tech-island-subnet]
google_compute_router.router: Refreshing state... [id=projects/tech-island-482603/regions/europe-west2/routers/tech-island-router]
google_compute_global_address.private_ip_range[0]: Refreshing state... [id=projects/tech-island-482603/global/addresses/tech-island-private-ip-range]
google_compute_firewall.internal: Refreshing state... [id=projects/tech-island-482603/global/firewalls/tech-island-allow-internal]
google_artifact_registry_repository_iam_member.github_actions_writer: Refreshing state... [id=projects/tech-island-482603/locations/europe-west2/repositories/tech-island-containers/roles/artifactregistry.writer/serviceAccount:tech-island-github-actions@tech-island-482603.iam.gserviceaccount.com]
google_service_networking_connection.private_vpc_connection[0]: Refreshing state... [id=projects%2Ftech-island-482603%2Fglobal%2Fnetworks%2Ftech-island-vpc:servicenetworking.googleapis.com]
google_compute_router_nat.nat: Refreshing state... [id=tech-island-482603/europe-west2/tech-island-router/tech-island-nat]
google_container_cluster.primary: Refreshing state... [id=projects/tech-island-482603/locations/europe-west2/clusters/tech-island]
google_sql_database_instance.postgres[0]: Refreshing state... [id=tech-island-postgres-70903f74]
google_sql_user.app_user[0]: Refreshing state... [id=techisland//tech-island-postgres-70903f74]
google_sql_database.default[0]: Refreshing state... [id=projects/tech-island-482603/instances/tech-island-postgres-70903f74/databases/techisland]
google_container_node_pool.primary_nodes: Refreshing state... [id=projects/tech-island-482603/locations/europe-west2/clusters/tech-island/nodePools/tech-island-node-pool]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project_service.required_apis["storage.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "tech-island-482603"
      + service            = "storage.googleapis.com"
    }

  # google_service_account.user_service will be created
  + resource "google_service_account" "user_service" {
      + account_id   = "tech-island-user-service"
      + description  = "Service account for user-service to generate signed URLs for avatar uploads"
      + disabled     = false
      + display_name = "User Service"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "tech-island-482603"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.user_service_workload_identity will be created
  + resource "google_service_account_iam_member" "user_service_workload_identity" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:tech-island-482603.svc.id.goog[apps/user-service]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # google_storage_bucket.user_avatars will be created
  + resource "google_storage_bucket" "user_avatars" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EUROPE-WEST2"
      + name                        = "tech-island-482603-user-avatars"
      + project                     = "tech-island-482603"
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + cors {
          + max_age_seconds = 3600
          + method          = [
              + "GET",
              + "PUT",
              + "POST",
            ]
          + origin          = [
              + "https://*.34.142.82.161.nip.io",
            ]
          + response_header = [
              + "Content-Type",
            ]
        }

      + lifecycle_rule {
          + action {
              + type = "Delete"
            }
          + condition {
              + age                   = 30
              + matches_prefix        = [
                  + "temp/",
                ]
              + matches_storage_class = []
              + matches_suffix        = []
              + send_age_if_zero      = true
              + with_state            = (known after apply)
            }
        }

      + versioning {
          + enabled = true
        }
    }

  # google_storage_bucket_iam_member.public_read will be created
  + resource "google_storage_bucket_iam_member" "public_read" {
      + bucket = "tech-island-482603-user-avatars"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "allUsers"
      + role   = "roles/storage.objectViewer"
    }

  # google_storage_bucket_iam_member.user_service_object_admin will be created
  + resource "google_storage_bucket_iam_member" "user_service_object_admin" {
      + bucket = "tech-island-482603-user-avatars"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectAdmin"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + user_avatars_bucket                       = "tech-island-482603-user-avatars"
  + user_service_service_account              = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @jerome3o, Action: `pull_request`*